{
  "ticker": "SHOP",
  "endpoint": "profile",
  "fetched_at": "2025-09-05T14:21:32.694762",
  "data": [
    {
      "symbol": "SHOP",
      "price": 146.82,
      "beta": 2.7,
      "volAvg": 7986685,
      "mktCap": 190820106564,
      "lastDiv": 0,
      "range": "65.86-156.85",
      "changes": 1.67,
      "companyName": "Shopify Inc.",
      "currency": "USD",
      "cik": "0001594805",
      "isin": "CA82509L1076",
      "cusip": "82509L107",
      "exchange": "NASDAQ Global Select",
      "exchangeShortName": "NASDAQ",
      "industry": "Software - Application",
      "website": "https://www.shopify.com",
      "description": "Shopify Inc., a commerce company, provides a commerce platform and services in Canada, the United States, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. The company's platform enables merchants to displays, manages, markets, and sells its products through various sales channels, including web and mobile storefronts, physical retail locations, pop-up shops, social media storefronts, native mobile apps, buy buttons, and marketplaces; and enables to manage products and inventory, process orders and payments, fulfill and ship orders, new buyers and build customer relationships, source products, leverage analytics and reporting, manage cash, payments and transactions, and access financing. It also sells custom themes and apps, and registration of domain names; and merchant solutions, which include accepting payments, shipping and fulfillment, and securing working capital. The company was formerly known as Jaded Pixel Technologies Inc. and changed its name to Shopify Inc. in November 2011. Shopify Inc. was incorporated in 2004 and is headquartered in Ottawa, Canada.",
      "ceo": "Tobias Lütke",
      "sector": "Technology",
      "country": "CA",
      "fullTimeEmployees": "8100",
      "phone": "16132412828",
      "address": "151 O'Connor Street",
      "city": "Ottawa",
      "state": "ON",
      "zip": "K2P 2L8",
      "dcfDiff": 130.97674,
      "dcf": 15.13326377758782,
      "image": "https://images.financialmodelingprep.com/symbol/SHOP.png",
      "ipoDate": "2015-05-20",
      "defaultImage": false,
      "isEtf": false,
      "isActivelyTrading": true,
      "isAdr": false,
      "isFund": false
    }
  ]
}